Food Delivery Assessment (Data Engineering Track)

In [61]:
#Install Required Libraries
#Run these commands in your terminal or Jupyter Notebook to install necessary Python libraries:
#pip install pandas sqlalchemy psycopg2-binary

In [91]:
import numpy as np
import pandas as pd

In [93]:
#1. Load the CSV into a Pandas DataFrame:
    # Load the dataset
file_path = 'Resources/food_order.csv'  # Adjust path if needed
food_order_df = pd.read_csv(file_path)

In [95]:
# Preview the first few rows
food_order_df

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24
...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24

In [97]:
print(food_order_df.dtypes)

df_summary = food_order_df.describe(include='all')
df_summary

order_id                   int64
customer_id                int64
restaurant_name           object
cuisine_type              object
cost_of_the_order        float64
day_of_the_week           object
rating                    object
food_preparation_time      int64
delivery_time              int64
dtype: object

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
count,1.898000e+03,1898.000000,1898,1898,1898.000000,1898,1898,1898.000000,1898.000000
unique,NaN,NaN,178,14,NaN,2,4,NaN,NaN
top,NaN,NaN,Shake Shack,American,NaN,Weekend,Not given,NaN,NaN
freq,NaN,NaN,219,584,NaN,1351,736,NaN,NaN
mean,1.477496e+06,171168.478398,NaN,NaN,16.498851,NaN,NaN,27.371970,24.161749
std,5.480497e+02,113698.139743,NaN,NaN,7.483812,NaN,NaN,4.632481,4.972637
min,1.476547e+06,1311.000000,NaN,NaN,4.470000,NaN,NaN,20.000000,15.000000
25%,1.477021e+06,77787.750000,NaN,NaN,12.080000,NaN,NaN,23.000000,20.000000
50%,1.477496e+06,128600.000000,NaN,NaN,14.140000,NaN,NaN,27.000000,25.000000
75%,1.477970e+06,270525.000000,NaN,NaN,22.297500,NaN,NaN,31.000000,28.000000
max,1.478444e+06,405334.000000,NaN,NaN,35.410000,NaN,NaN,35.000000,33.000000

In [99]:
# Identify empty/blank values in all rows
null_rows = food_order_df[food_order_df.isna().any(axis=1)]
print(null_rows)
#no null values in data

Empty DataFrame
Columns: [order_id, customer_id, restaurant_name, cuisine_type, cost_of_the_order, day_of_the_week, rating, food_preparation_time, delivery_time]
Index: []

In [101]:
# Identify duplicate rows
#duplicates_df = food_order_df.drop_duplicates()
#duplicates_df

for col in food_order_df:
    print(food_order_df[col].unique())

[1477147 1477685 1477070 ... 1477819 1477513 1478056]
[337525 358141  66393 ...  97838 292602 397537]
['Hangawi' 'Blue Ribbon Sushi Izakaya' 'Cafe Habana'
 'Blue Ribbon Fried Chicken' 'Dirty Bird to Go' 'Tamarind TriBeCa'
 'The Meatball Shop' 'Barbounia' 'Anjappar Chettinad' 'Bukhara Grill'
 'Big Wong Restaurant \x8c_Â¤Â¾Ã‘Â¼' 'Empanada Mama (closed)' 'Pylos'
 "Lucky's Famous Burgers" 'Shake Shack' 'Sushi of Gari' 'RedFarm Hudson'
 'Blue Ribbon Sushi' 'Five Guys Burgers and Fries' 'Tortaria'
 'Cafe Mogador' 'Otto Enoteca Pizzeria' 'Vezzo Thin Crust Pizza'
 'Sushi of Gari 46' 'The Kati Roll Company' 'Klong' '5 Napkin Burger'
 'TAO' 'Parm' 'Sushi Samba' 'Haru Gramercy Park'
 'Chipotle Mexican Grill $1.99 Delivery' 'RedFarm Broadway' 'Cafeteria'
 'DuMont Burger' "Sarabeth's East" 'Hill Country Fried Chicken' 'Bistango'
 "Jack's Wife Freda" "Mamoun's Falafel" 'Prosperity Dumpling'
 'Blue Ribbon Sushi Bar & Grill' 'Westville Hudson' 'Blue Ribbon Brooklyn'
 'Nobu Next Door' 'Osteria Morini' 'Haandi' 'Benihana' 'Han Dynasty'
 'Chote Nawab' 'Mission Cantina' "Xi'an Famous Foods" 'Rubirosa'
 "Joe's Shanghai \x8e_Ã€\x8eÃ¼Â£Â¾Ã·Â´" 'Bareburger' 'The Odeon' 'Pongsri Thai'
 'Yama Japanese Restaurant' 'Momoya' 'Balthazar Boulangerie' 'CafÃŒÂ© China'
 'Boqueria' 'Song Thai Restaurant & Bar' 'Five Leaves'
 'Pinto Nouveau Thai Bistro' "Amy Ruth's" 'Pepe Giallo' 'indikitch'
 'Yama 49' 'Piccolo Angolo' 'Pepe Rosso To Go' "L'Express" 'Amma'
 'Delicatessen' "S'MAC" "Vanessa's Dumplings" 'Bhatti Indian Grill'
 'Taro Sushi' 'Donburi-ya' 'Hatsuhana' 'Samurai Mama' 'Waverly Diner'
 'Tarallucci e Vino Restaurant' "P.J. Clarke's" 'Lantern Thai Kitchen'
 'ilili Restaurant' 'The Smile' "Vanessa's Dumpling House" "Bubby's "
 'Woorijip' 'Dirty Bird To Go (archived)' 'Haveli Indian Restaurant'
 'Dos Caminos' 'da Umberto' 'Sushi of Gari Tribeca' 'Burger Joint'
 'Room Service' "Sarabeth's Restaurant" 'Xe May Sandwich Shop' 'Hibino'
 'Mira Sushi' 'Melt Shop' 'J. G. Melon' 'Hummus Place' 'Saravanaa Bhavan'
 'Friend of a Farmer' 'The Loop' 'Balade' 'Posto' 'Terakawa Ramen'
 'Kambi Ramen House' 'Wo Hop Restaurant' 'Spice Thai'
 "Dickson's Farmstand Meats" 'UVA Wine Bar & Restaurant'
 'Serafina Fabulous Pizza' 'Gaia Italian Cafe'
 'Chola Eclectic Indian Cuisine' 'Hot Kitchen' 'Junoon'
 'Ravagh Persian Grill' 'Rohm Thai' 'Dig Inn Seasonal Market' 'Olea'
 'Cho Dang Gol' 'El Parador Cafe' 'Socarrat Paella Bar'
 "Don's Bogam BBQ & Wine Bar" 'Alidoro' "Tony's Di Napoli"
 'Cipriani Le Specialita' 'Sushi Choshi' 'Kanoyama' 'V-Nam Cafe'
 'Zero Otto Nove' 'Dos Caminos Soho' 'Go! Go! Curry!' 'La Follia'
 'Izakaya Ten' '12 Chairs' 'Philippe Chow' 'The MasalaWala' 'brgr'
 "Carmine's" 'Asuka Sushi' 'Aurora' "Sarabeth's" 'Crema Restaurante'
 "Big Daddy's" 'Moonstruck on Second' 'Cafe de La Esquina' 'Olive Garden'
 '67 Burger' 'Tres Carnes' "Schnipper's Quality Kitchen" 'Nha Trang One'
 'Market Table' 'Galli Restaurant' 'Hampton Chutney Co.'
 'Byblos Restaurant' 'Grand Sichuan International' 'Le Grainne Cafe'
 'Il Bambino' 'Kori Restaurant and Bar' 'DespaÃŒÂ±a' 'Lamarca Pasta'
 'Lucky Strike' "Paul & Jimmy's" 'Hunan Manor' "Coppola's East" 'Emporio'
 'Wa Jeal' 'Le Zie 2000 Trattoria' 'Rye House' "Hiroko's Place"
 'Frank Restaurant' "Sarabeth's West" "'wichcraft"]
['Korean' 'Japanese' 'Mexican' 'American' 'Indian' 'Italian'
 'Mediterranean' 'Chinese' 'Middle Eastern' 'Thai' 'Southern' 'French'
 'Spanish' 'Vietnamese']
[30.75 12.08 12.23 29.2  11.59 25.22  6.07  5.97 16.44  7.18  5.92  8.1
 24.3  11.3  12.13 16.2  16.98 33.03 14.12 24.2  15.91 29.1   8.92 15.86
 21.88 14.02  9.17 12.18 31.33 29.05  8.39  9.12 15.47 16.01 29.83 19.89
 19.35 33.22 24.25 22.75  6.74 13.78 16.93 29.39 20.23 14.6   6.79 31.38
  8.34 12.46 14.55 32.93  8.   13.05  5.67 29.29 16.15 13.34  9.75  6.69
  4.75 12.56 21.2  19.31 16.3  25.27 14.79  5.72  9.22 16.39 17.03 21.83
 31.29 11.83 22.26 20.47 15.81 22.36  8.68 12.9  29.15  7.86 16.1  12.95
 11.69 12.32 14.99 10.38  9.65  5.77  9.56 29.34 11.16 14.07 22.8  15.23
 16.49  8.83 16.25 16.83 10.24 19.4  13.97 13.    8.49 20.18 19.59 16.11
 12.27 13.39  9.02 15.33 31.43 29.35 15.28  9.6   8.88 15.96  8.05  8.54
  7.23 19.69  9.27  8.97 11.64 13.15  9.41  9.07 14.46  6.7  19.45 12.22
 29.25 16.05 17.08 32.98 13.73 14.31 14.7  15.52  6.11 21.93 15.76  9.46
 12.61 22.85 16.06 21.39  8.25 14.94 14.26 21.34 14.16  5.68 15.57 14.45
  8.15  8.78  8.59 15.62  5.87  6.01  9.85  6.84  5.82  7.96  9.7   4.85
  6.06 12.66  6.02  7.08 12.37 14.84 22.31 13.1  14.75 24.35 25.17  9.26
  9.55 13.92  4.66 13.87  7.61 15.72  8.35 14.21 14.65  4.71  8.63 13.68
 11.93 35.41  6.64 10.72  8.73 16.78  5.58 13.63 29.54 29.49 15.04 18.24
  4.47  8.98 15.71  8.93  9.51  9.61  7.38 13.19 10.82  6.26  8.2   7.33
 12.71  5.63 17.07  5.48 22.12 15.77  6.45 11.79 11.98 20.32 28.57 22.07
 21.29 14.41 29.88  4.8  10.14  8.44 16.54  7.71 29.78 31.86 19.98 12.42
 12.52 15.38  8.3  13.24  8.01 29.68  9.32 12.51  5.34  6.4  19.3  17.85
 16.88 13.77  5.73 11.84 15.67 13.58 33.18  6.55 20.52 28.62 15.18 29.3
 12.81 29.44 11.11 14.5  22.02 11.88 33.32 18.43 12.47 20.13 20.57 15.09
 19.74 18.04 31.67  5.05  7.03 14.8  12.17  7.28 15.13  7.81 16.74  9.31
 21.25 31.87 19.02 34.19  5.53 22.46 29.73 10.43 19.5   4.9  15.37  7.67
  7.91 13.53 33.37 19.6  13.48 20.71 20.61  7.66 10.86  7.95 20.86 29.59]
['Weekend' 'Weekday']
['Not given' '5' '3' '4']
[25 23 20 28 33 21 29 34 24 30 35 32 31 27 22 26]
[20 23 28 15 24 21 30 26 22 17 25 16 29 27 18 31 32 19 33]

In [103]:
#2. Clean and Prepare the Data:
    # Handle missing values in columns like rating or cuisine_type.
    
# Replace "Not given" ratings with 0 and convert to integer
food_order_df['rating'] = food_order_df['rating'].replace('Not given', 0).astype(int)

# Drop rows with missing critical data
food_order_df.dropna(subset=['restaurant_name', 'cuisine_type', 'delivery_time'], inplace=True)

In [105]:
# Create unique IDs for restaurants.
# Generate a unique restaurant ID
restaurant_table = food_order_df[['restaurant_name', 'cuisine_type']].drop_duplicates().reset_index(drop=True)
restaurant_table['restaurant_id'] = range(1, len(restaurant_table) + 1)

In [107]:
# Merge restaurant IDs back into cleaned dataframe
food_order_clean_df = pd.merge(food_order_df, restaurant_table, on=['restaurant_name', 'cuisine_type'], how='left')
food_order_clean_df

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,restaurant_id
0,1477147,337525,Hangawi,Korean,30.75,Weekend,0,25,20,1
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,0,25,23,2
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,3
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15,4
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,5
...,...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,32
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,88
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,0,31,24,18
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,39
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,0,28,24,18

In [109]:
#3. Normalize Data into Two Tables:

# Orders Table
orders_table = food_order_clean_df[['order_id', 'restaurant_id', 'customer_id', 'cost_of_the_order', 
                   'day_of_the_week', 'rating', 'food_preparation_time', 'delivery_time']]

# Restaurants Table
restaurants_table = restaurant_table[['restaurant_id', 'restaurant_name', 'cuisine_type']]

In [115]:
# order info separated from data
orders_table

,order_id,restaurant_id,customer_id,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,1,337525,30.75,Weekend,0,25,20
1,1477685,2,358141,12.08,Weekend,0,25,23
2,1477070,3,66393,12.23,Weekday,5,23,28
3,1477334,4,106968,29.20,Weekend,3,25,15
4,1478249,5,76942,11.59,Weekday,4,25,24
...,...,...,...,...,...,...,...,...
1893,1476701,32,292602,22.31,Weekend,5,31,17
1894,1477421,88,397537,12.18,Weekend,5,31,19
1895,1477819,18,35309,25.22,Weekday,0,31,24
1896,1477513,39,64151,12.18,Weekday,5,23,31
1897,1478056,18,120353,19.45,Weekend,0,28,24

In [117]:
#restaurant info separated from data
restaurants_table

     restaurant_id            restaurant_name cuisine_type
0                1                    Hangawi       Korean
1                2  Blue Ribbon Sushi Izakaya     Japanese
2                3                Cafe Habana      Mexican
3                4  Blue Ribbon Fried Chicken     American
4                5           Dirty Bird to Go     American
..             ...                        ...          ...
174            175                  Rye House     American
175            176             Hiroko's Place     Japanese
176            177           Frank Restaurant      Italian
177            178            Sarabeth's West     American
178            179                 'wichcraft     American

[179 rows x 3 columns]

Step 4: Load Data into PostgreSQL

In [127]:
#Use SQLAlchemy to load data into PostgreSQL:
import sqlalchemy
from sqlalchemy import create_engine

# Connect to PostgreSQL
   # Replace username and password with your PostgreSQL credentials.
# engine = create_engine('postgresql+psycopg2://USERNAME:YourPGAdminPASSWORDhere@localhost:5432/food_delivery')

In [131]:
# Load data into PostgreSQL
restaurants_table.to_sql('restaurants', engine, if_exists='append', index=False)
orders_table.to_sql('orders', engine, if_exists='append', index=False)

print("Data loaded successfully!")

Data loaded successfully!

Step 5: Verify Data
1. Open pgAdmin.
2. Query the tables to check the data:

SELECT * FROM restaurants;
SELECT * FROM orders;

Step 6: Query and Display Data in Python

In [137]:
#Read data from PostgreSQL back into Pandas for analysis
# Query data from PostgreSQL
orders_query = pd.read_sql('SELECT * FROM orders', engine)
orders_query.head()

,order_id,restaurant_id,customer_id,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,1,337525,30.75,Weekend,0,25,20
1,1477685,2,358141,12.08,Weekend,0,25,23
2,1477070,3,66393,12.23,Weekday,5,23,28
3,1477334,4,106968,29.20,Weekend,3,25,15
4,1478249,5,76942,11.59,Weekday,4,25,24

In [145]:
# Analyze average delivery time by cuisine
query = """
SELECT r.cuisine_type, AVG(o.delivery_time) AS avg_delivery_time
FROM orders o
JOIN restaurants r ON o.restaurant_id = r.restaurant_id
GROUP BY r.cuisine_type
ORDER BY avg_delivery_time;
"""
delivery_time = pd.read_sql(query, engine)
delivery_time

      cuisine_type  avg_delivery_time
0           Korean          20.923077
1             Thai          23.157895
2          Spanish          23.416667
3    Mediterranean          23.586957
4         Southern          23.823529
5          Chinese          23.855814
6   Middle Eastern          24.081633
7           Indian          24.082192
8         Japanese          24.131915
9         American          24.193493
10         Mexican          24.389610
11         Italian          24.567114
12          French          25.333333
13      Vietnamese          26.142857